public/man/man1/lsattr.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - lsattr.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - lsattr.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>lsattr - list ext2/ext3/ext4 file attributes</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>lsattr</strong> [ <strong>-RVadlpv</strong> ] [ <em>files…</em> ]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>lsattr</strong> lists the file attributes on an ext2/ext3/ext4 file system. See
*chattr*(1) for a description of the attributes and what they mean.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<dl>
<dt>
<strong>-R</strong>
</dt>
<dd>Recursively list attributes of directories and their contents.</dd>
<dt>
<strong>-V</strong>
</dt>
<dd>Display the program version.</dd>
<dt>
<strong>-a</strong>
</dt>
<dd>List all files in directories, including files that start with
`.&#39;.</dd>
<dt>
<strong>-d</strong>
</dt>
<dd>List directories like other files, rather than listing their
contents.</dd>
<dt>
<strong>-l</strong>
</dt>
<dd>Print the options using long names instead of single character
abbreviations.</dd>
<dt>
<strong>-p</strong>
</dt>
<dd>List the file&#39;s project number.</dd>
<dt>
<strong>-v</strong>
</dt>
<dd>List the file&#39;s version/generation number.</dd>
</dl>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
AUTHOR
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>lsattr</strong> was written by Remy Card &lt;Remy.Card@linux.org&gt;. It is currently
being maintained by Theodore Ts&#39;o &lt;tytso@alum.mit.edu&gt;.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
BUGS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>There are none :-).</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
AVAILABILITY
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p><strong>lsattr</strong> is part of the e2fsprogs package and is available from
<a href="http://e2fsprogs.sourceforge.net.">http://e2fsprogs.sourceforge.net.</a></p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
SEE ALSO
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>*chattr*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
